{
  "New York": "A city of endless possibilities, high energy and great diversity, New York has always been the benchmark for first-rate dining, unparalleled shopping and cultural activity. For visitors, it’s an exciting city and, at times, more than a little intimidating. New York natives always seem to be in a hurry, but with Midtown traffic often at a complete standstill, it may be faster to walk across town than to take a bus. It’s love at first sight when the Empire State Building comes into view, and the Statue of Liberty awes even the most blase tourist. Broadway shows will wow you; browsing Bloomingdale’s will amaze you. The views from the Staten Island Ferry are a knockout, and downtown nightlife will keep you busy in the city that never sleeps. You’ll find Central Park smack dab in the middle of New York with many of the city’s best museums on either side. Surrounding Manhattan are Brooklyn, the Bronx, Queens and Staten Island. Many Brooklyn neighborhoods have become as popular and chic as Manhattan’s. Smart shops and trendy restaurants have spread like wildfire, drawing Manhattanites across the river for fashionable dining and serious shopping. Five Brooklyn communities that are definitely worth a look are Brooklyn Heights, Cobble Hill, Park Slope, Williamsburg and Brighton Beach. The Bronx has experienced some gentrification, creating attractions beyond the Bronx Zoo, such as the New York Botanical Garden, Yankee Stadium, City Island (which has the feel of a New England village) and Woodlawn Cemetery — the final resting place of Duke Ellington, Celia Cruz, Herman Melville, Miles Davis, J.C. Penney and Elizabeth Cady Stanton. Meanwhile, Queens offers the Queens Museum, Citi Field (home of the Mets), the Jamaica Bay Wildlife Refuge, contemporary art at Public School No. 1, and vibrant ethnic neighborhoods like Flushing (Asian), Astoria (Greek) and Jackson Heights (Indian and Latin American). Beyond the ferry terminal, Staten Island has a cultural center at Snug Harbor, its own zoo and a Tibetan art museum, as well as historic Richmond Town (with buildings and artifacts dating back to the 1600s).",
  "Chicago": "Walking around the historical center of Chicago, which locals call the Loop, you’ll find your gaze drawn inexorably upward. All around you are some of the most striking and diverse architectural styles in America. Just as your eye catches an elaborate Art Deco detail in one direction, you’ll spot an ultra-modern tower in the other. Old mingles with new in what amounts to a living museum of buildings from the second half of the 1800s to the present. Chicago doesn’t have mountains like Denver or beaches like Miami; it has buildings. Sure, as the nation’s third largest city, Chicago serves up world-class attractions like museums, an active arts scene and championship sports teams — as well as homegrown favorites like deep-dish pizza, Oprah and the Blues Brothers. But it’s in architecture that the Windy City really shines. This is, in fact, the birthplace of the modern building. The world’s first skyscraper, the Home Insurance Building, was built here in 1885, and while that building was taken down in the 1930s, Chicago is today home to three of the tallest buildings in the world: the Willis Tower (formerly known as the Sears Tower, it stands at 1,450 feet), Aon Center (1,136 feet) and John Hancock Center (1,128 feet). Head up to the Willis or Hancock observation decks and you’ll look down over a city shaped by architectural innovators like Daniel Burnham, Louis Sullivan, Mies van der Rohe and Frank Lloyd Wright. Chicago did not start off on such a grand scale. The city was founded at the mouth of the Chicago River in 1779 by Jean Baptiste Point du Sable, a fur trader believed to be from Haiti. But by 1848, with the completion of the 100-mile Illinois and Michigan Canal connecting the Chicago to the Mississippi, this little trading post was on its way to becoming a major transportation hub. The “Great Chicago Fire” in 1871 dealt a devastating blow, but the city rebuilt with the help of pioneering architects like Burnham, whose motto “Make no little plans” was well embraced. Chicago is at its most impressive along the “Magnificent Mile” portion of North Michigan Avenue, where visitors will delight not only in the upscale shops but also such striking attractions as the neo-Gothic Tribune Tower, home of the Chicago Tribune newspaper, and the Beaux-Arts Wrigley Building. To see how the design innovation continues, check out the work of renowned contemporary architect Frank Gehry at Millennium Park, which has become an indelible part of the downtown core. Downtown Chicago has the largest business district in the U.S. outside of Manhattan, and it’s all hustle and bustle. The streets fill with people at lunch hour when all the office towers seem to spew forth their occupants. But beyond the mayhem are artsy and ethnic neighborhoods, beautiful parks and the expansive shores of Lake Michigan. Civic and ethnic pride reigns supreme. The Windy City is home to the world’s largest Polish population outside of Warsaw, and famously dyes the Chicago River green each year in celebration of St. Patrick’s Day. Visitors are often surprised to find this big, brash city a very friendly place. You’re almost guaranteed to discover, as in the song, that Chicago is your “kind of town.”",
"Seattle" : "If I can offer you only one piece of advice for traveling to Seattle it would be this — dress in layers. While never too cold or too warm, and, of course, famous for an almost daily drizzle, the weather in Seattle is nevertheless hard to predict, especially in late winter/early spring. And weather forecasts aren’t always helpful. Prior to jetting off to Seattle for a recent four-night visit, I checked Weather.com to see what I should expect. Heavy rain storms and cool weather were predicted, so into the suitcase went several cold-weather items. But then my overpacking gene took over and, despite the ugly forecast, I threw a few warm-weather options in as well. Thank goodness I did. As it turned out, three out of four days started out foggy and cold, but then turned warm and sunny, before ending crisp and cold again. Because I had thrown in some tees, a light sweater and a zip-up sweatshirt, I was able to put on and take off layers as needed. Care for a second piece of Seattle travel advice? Rent a house or apartment. I was in Seattle for a cousin’s bat mitzvah; with me and my husband were my parents, and my sister and her family, including my 3-year-old niece. We looked at hotels at first, but the cheapest rates we could find (in a decent hotel) started at about $140. That wasn’t bad, but the necessity of eating out would add to the cost. Then my dad looked on VRBO.com for short-term rentals. Prices, when split three ways, were slightly less than the per-night hotel rates, plus we would all be together and could cook meals in the house and share grocery expenses. Not only did renting a house bring down the overall trip price, but we got a great location right on Green Lake, within a 20-minute drive of everywhere we wanted to go. The last tidbit I picked up during my short stay in Seattle involves parking near Pike Place Market. If you’re planning to drive to the Market, try and wait until Sunday. Parking on 1st and 2nd Avenues is free that day, though you’ve got to get there pretty early to snag a spot. Otherwise, don’t park in a lot within three or four blocks. The first lot we pulled into on 2nd Avenue would have cost about $40. A lot just two blocks farther away, on the corner of 3rd Avenue, cost $12.",
"Barcelona" : "Prior to my cruise, my wife and I spent two days visiting this lovely city that is overflowing with many sights, sounds and tasty foods. I arrived at the spanking new terminal 1, within minutes I was out of customs, passport control and the usual hoopla, it was the fastest I have ever experienced. Taxis are expensive in Barcelona so we had planned to exclusively use the city subway system which is very simple to use. We walked to the airport commuter train station where my wife bought a T10 ticket (cost 7 Euros) which can be used and shared (your ticket counts down) and rode the commuter train to the city, we then changed to the subway system to get to our hotel. The only downside was lugging our luggage up and down stairs when we changed from the train to the subway, a minor inconvenience but a HUGE savings(figure the average taxi to hotel is between 30-40 Euros). I used my points to stay at the lovely and beautiful ” Hilton Diagonal Mar”, I would highly recommend this lovely hotel. The Hotel is located in the suburbs away from all the noise and hustle of Las Rambles and personally I am glad we stayed where we did as I saw a little more of what it is like to live in Barcelona. With much to see and little time to spare, we decided to-do a bike excursion with “fatbikes”, no need to prebook just show up at the designated spot. On our bikes we visited many of the sights(too many to mention) and stopped at the unbelievable magnificent Sagrada Famili words can not describe this awesome structure I was told that entering sagrada familia is only worth it if you have a lot of time to spend in Barcelona, our bike tour concluded with a stop at the beach. Going on this bike excursion was perhaps the highlight of my city visit and I would highly recommend this bike tour to anyone who wants to see a lot of the city sites while saving your feet for later. The bike excursion is not strenuous and was a nice wakeup after the long flight. The following day we took a trip to Montserrat and timed it so that we got to see the black Madonna while listening to the boys’ choir (they perform at 1:00pm). Getting to Montserrat is easy but will take almost an entire day and plan to do a lot of walking, personally I was not overly impressed with Montserrat and in retrospect I would have rather stayed in town. That evening my wife and I ate dinner at a small food stand in La Boqueria, La Boqueria is located about halfway down Las Ramables and is similar to a farmers markets with many more fresh items in a compact area, be aware that most of the shops and eating establishments at La Boqueria close early, walking down Las Rambles is similar to Times Square in New York but with many more characters and street performers. In the evening we visited the Magic Fountains (it is FREE), shows start running continuously at about 9.00pm and are repeated. At the fountains there is very little sitting room but you can sit across the street in the park (that is where we sat) and still have a good view. Park Guell is a must visit with all its monuments and you can walk to the three crosses (Tres Cruses) which are also in the park. We also visited the Gaudi masterpiece buildings; Casa Mila, Batllo and Casa Amataller, we did not go into the buildings but seeing them on the outside was incredible. Columbus Monument (you can go inside the monument and go to the top) is a must visit and was used as the start for our Las Rambles walk; Plaza Catalunya and Passeig de Gràcia are easy strolls but they are crowed no matter the time. Prior to my trip I had read many reports about pickpockets in Barcelona to be on the safe side I bought a money belt that tucks into my pants, my cash was secure and I encountered no problems. In conclusion, two days is just not enough to see this lovely city and there is no need to use the Hop On/Off bus(Bus Touristic/plan on standing in long lines to get on) a good subway map along with some comfortable walking shoes is more then sufficient, enjoy the city",
"Mexico City" : "Mexico City, the oldest and most populated city in North America, blends its historical districts with modern-day urban sprawl, guaranteeing visitors an experience like no other. Once known as the City of Palaces, Mexico City attractions include the National Palace, now a museum featuring Diego Rivera murals depicting the country's history; the Palace of Fine Arts; and the second-most visited basilica in the world, the Basilica de Guadalupe. Eco-travelers will have plenty to explore, with the Popocatepetl and Iztaccihuatl volcanoes to the southeast of the city and the canals in Xochimilco Ecological Park. Festivals and food also play a major part in the lives of the people in Mexico City, and guests can sample unusual treats such as sopas, antojitos, and insect tacos stuffed with grasshoppers or ant roe. Fiestas like Day of the Dead and Independence Day, when the Zocalo neighborhood's main square lights up, provide entertainment for locals and tourists alike. Flights to Mexico City land at Benito Juarez International Airport.  With a warm climate year-round, Mexico City is a popular destination for visitors from all over the world. After a warmer spring, summer is typically rainy, followed by a drier and slightly cooler fall. Fewer people visit in the winter, when things cool off, and spring, when temperatures peak. Mexico City experiences a mild climate throughout the year. Spring high temperatures range between 77 and 79 degrees, and summer sees high temperatures between 73 and 76. By fall, the rainy season has ended and temperatures drop only a few degrees, making it the most comfortable time to visit. The lowest temperature highs, ranging from 70 to 73 degrees, are in winter. September and December tend to get busy during the major holidays of Independence Day (September 16), Christmas, and New Year's Day. Hotels, shops, and attractions remain open throughout the year. Prices remain fairly steady throughout the year, as international and domestic tourists arrive in the city on a regular basis.",
"Las Vegas" : "Nonstop action makes a Las Vegas vacation a 24-hour-a-day proposition. Vegas delivers the world, or at least a neon-lassoed version of it, to tens of millions of visitors every year. No other city offers a rollercoaster ride across the New York skyline, high-stakes blackjack, a trip to the top of the Eiffel Tower, a sexy pirate show, tigers, and all-you-can-eat Kobe beef in a single day. Las Vegas hotels competing for visitors are in a constant battle to outdo one another with bigger shows, swankier bars, and the most memorable surroundings. The Las Vegas Strip is the heart of the action, but there's also plenty to do and see elsewhere. East of the Strip, the Convention Center is nearly always hopping with a steady stream of conventioneers looking to work and play. And, downtown Las Vegas, long the center of tourism, is now primarily known for its more affordable accommodations, friendly slots, and the Fremont Street Experience, with its shopping, entertainment, and light shows. The nearby suburbs of Green Valley, Lake Las Vegas, and Summerlin offer lower-key (and often more affordable) chances to gamble, shop, relax, and indulge in some spa time. If nonstop neon isn't your thing, do not forget about the world beyond the casino walls. The Las Vegas area is home to impressive feats of engineering and great natural beauty. Hoover Dam is a short drive away, and Red Rock Canyon and Valley of Fire State Park are just a few of the rugged landscapes that offer an outdoorsy respite from the glitz of Vegas. You can even book a helicopter day tour to visit the Grand Canyon. Affordable flights to Las Vegas are be easy to find, since many airlines offer service from a myriad of departure cities. So much service means that rates stay competitive and Las Vegas airfare sales are common, though prices do rise in times of high demand.",
"Moscow" : "Once a popular setting for spy movies and Cold War propaganda films, Moscow has emerged as a major tourist destination — and justifiably so. For Americans brought up during the pre-perestroika era, strolling through Red Square and exploring the city without the minders that used to be required can be an emotional and exhilarating experience. If St. Petersburg is the soul of Russia, Moscow is its heart, an international marketplace where business gets done and young people come to work (and play). Capitalism has caught on in a big way, and conspicuous consumption is everywhere, judging by the Ferraris, Maybachs and Porsches seen on the street. Prices are sky-high at trendy cafes — sushi is the current Muscovite cuisine of choice — and nightclubs. That being said, you can still find bargain eats along the Old Arbat (a pedestrian walkway catering to tourists) and at the chain restaurants that Russians themselves use. Although Moscow has a well-earned reputation for traffic, it’s a greener city than you’d think, with a ring of parks running next to major streets and many others (including the famed Gorky) within the city center. This green belt provides a fascinating opportunity to observe Russians in their daily life; you’ll see kids scrambling on playgrounds, young adults reading their iPads and old men competing in chess tournaments. The Cyrillic alphabet can make getting around a little challenging — very few signs are in English. But the Moscow Metro, notable for its grand interiors and stunning artwork, offers more than 180 stops and goes everywhere you need to be. (It’s also loads cleaner than U.S. counterparts.) Your concierge should have maps with stops labeled in both English and Cyrillic letters. Allow at least two or three full days to explore Moscow. Besides the famed onion domes of St. Basil’s Cathedral, the Kremlin alone contains nine churches and several museums, including the Diamond Fund with its must-see royal jewels. Cultural performances, including those at the world-renowned Bolshoi Theater, take place almost every night. Dive in and be prepared to have your stereotypes shattered.", 
"Prague" : "We were in Prague for three day prior to river cruise with Uniworld on the River Beatrice. We stayed at the Maximilian which turned to be very near the Old Town Square. We had plans to use a Prague Travel Pass, but our communications broke down and we never got it authorized for use. Anyway it didn’t matter we simply walked around the whole three days. We saw the clock do its thing at noon, we drank in the afternoon in the square and watched people. We walked twice to the St. Charles Bridge and first time walked it in the rain, well it stopped part way across. Once on the other side we had two gyros for lunch and a coke. We walked back to the square and sat on a park bench and watched the world go by. We had dinner the a great little restaurant called the “Crazy Cow” We had a 400g New York Steak and chips, two beers and wife had wine. The meat was cooked to perfection. It was great dinner. The next we came back again, this time we shared a Caesar salad and it was more than enough to two. We walked in the rain again the second day, stood under the London Powder tower to get out of the rain. There is a great variety of souveniers and many stores to chose from. The area is very clean. A word about our hotel. The room was just right and it had a balcony facing the front. All you could see were more roofs and building, but it was perfect. We had breakfast included with the room. We had a problem with our arranged transfer to Passau not arriving at the appointed time and the staff of the hotel helped us and we finally got our transportation and made it the ship on time. My wife and I enjoyed the three days we were just taking in the sights nearby and it was great. ",
"Berlin" : "We had a delightful 10 day stay in Berlin before we got on a cruise ship for the Baltics and a Transatlantic cruise back to NYC. It was probably the highlight of the vacation, we really enjoyed Berlin. We stayed in Berlin at the Adina Apartment Hotel Berlin Hackescher Markt, 11 An der Spandauer Brcke, Berlin 10178. Located in the historic district of Mitte, it was also located in the old Jewish District and an easy walk to the river Spree with its many boat ride opportunities. We loved this hotel; it was in an awesome location and enabled us to walk almost everywhere. It took 15 minutes to get to the hotel from the airport, although we came in late at about 9pm and there was no traffic at all. It was located next to the train station/subway station at Hackescher Markt, as well as a tram line, making it a perfect jump off spot for all discoveries. As an added bonus we were surrounded by lovely restaurants, I cannot say enough about this hotel. The hotel staff was excellent; they were always available to help with directions and suggestions. There was free Internet available for use in the lobby area and the lobby area had lots of couches and chairs and places to gather and email. The rooms were well appointed; we had a nice sized room with a huge balcony and a nice kitchen for snacks and morning coffee. It was well stocked with all the dishes and cooking utensils for making meals and even a dishwasher to clean up afterwards. We had an excellent coffee maker and they provided coffee. Around the corner were several well-stocked markets so we could buy whatever we needed such as coffee, fruit, and even meat, cheese, and bakery items. During our stay we used the Ho-Ho bus, there were actually 3 different ones but we choose the least expensive one because it served our needs well. Make sure you check out all the Ho-Ho buses, their maps and costs so you can compare and pick the one that suites your needs best. We also used some “Frommers” and “fodors” walks to familiarize us with the areas. Some of these walks are available for free on the web. Our second day we used the Frommer’s walking tour called “Dark past, Bright future”. We walked through Mitte as we meandered our way past the new Jewish synagogue as well as a part of the ancient Jewish synagogue, among other interesting places. We found this wonderful Middle Eastern restaurant called Dada Falafel, which is very close to the Jewish synagogue. The food was delicious; we each ordered different plates and loved every morsel of food that we got there. The falafels were yummy, as were all the sauces, couscous, hummus, and more. This was one of the best falafel’s we had in a long time. This was certainly a be-back kind of the restaurant; we ended up eating here four times in the 10 days we were in Berlin. Not only was the service spectacular, they had live entertainment and the singer and pianist, which were wonderful. In total that day we must’ve walked 8 miles and my feet were killing me. We retired early because we plan to get up really early and have a full day of touring. We had the reservations for the Reichstag tour the following day and were excited to visit. It turned out to be a highlight of the stay, it was interesting and at the top of it were magnificent views of Berlin. Got up early that day and ate at a local restaurant for breakfast which was really delicious. The restaurant was called Hackescher Hof. The breakfast menu was lovely, I had scrambled eggs with spinach and feta, wonderful toast, all of this for a mere €4.50.. We love this restaurant so much we ended up eating here almost every morning for breakfast. On to the Reichstag, we really enjoyed the experience and because I had made reservations in advance we got in quickly without waiting on any lines. After visiting this we walked to the Holocaust memorial, a haunting tribute to those murdered during the Nazi era. We also visited Checkpoint Charlie, as well as the Topography of terror. This was a somber afternoon but well worth the experiences and learning’s. Tomorrow we would visit the concentration camp outside Berlin. We found a Hertz car rental and grabbed the car we reserved and drove back to the hotel, we found driving in Berlin easy as well as all over Germany. Ken got to drive one 100MPH on the Autobahn, which was really fun! Having picked up our car the day before, it was time for our Mosaic tour of Sachsenhousen concentration camp with guide Brian. This camp was located close to Berlin although Chris and Ken had different opinions about how to get out of Berlin and ignored our GPS, who we finally referred to as Flossie! Anyway it took us three times as long as we anticipated to get to the train station where we would meet our mosaic tour guide Brian. Gratefully Brian waited for us. From there we walked for miles to get to the entrance of the concentration camp. My feet were killing me and we hadn’t even begun the tour. Brian gave a fantastic tour, for me it was so enlightening where I had thought it might be simply frightening. This was an educational tour and I learned so much, I really was impressed with Brian. Our tour mates were very kind as they waited for us an extra half-hour because we were late and we were really grateful for them. I highly recommend mosaic tours if you want to learn about what happened in a typical camp from a historical perspective. In spite of this being such a horrific subject, Brain taught me about how serious the new Germans are about anti-Semitism and all hateful behavior. I have to say I came away from this with a newfound love of the German people, as a Jew this says a lot! We came home fairly late, taking much less time to get back as the boys learned how to get back to Berlin using GPS! We decided to walk up to a new restaurant called Amrit, an Indian restaurant very close to the falafel place. The food was quite delicious, except the appetizer plate, which was really terrible, all fried and tasting bland. In spite of the food being tasty, the service was not very good. The waiter pointed to my husband stomach and embarrassed him, and all of us thought that was very rude. Good thing he didn’t do that to me cause I would’ve slapped him hard. So even though we enjoyed the food we would never go back there again. We stop for some dessert, Chris had to have apple torte and we walk to a restaurant on the river spree to get it. I had a scoop of ice cream, after ordering something called a Caramel Crunch, which was so hard it practically broke my teeth. I am not sure what they did to the Carmel but even the waitress could not eat it! Although we had returned here several times this ended up being our last visit. Another dinner place we visited several times which was across the street from our hotel was a Mediterranean restaurant called Trattoria Ossana. The food was quite good and reasonably priced. They had yummy thin-crusted Pizza’s and great pasta dishes. They did not have free tap water so we had to pay for bottled! After dinner we stopped at Häagen-Dazs and got some ice cream, right across the street and around the corner of our hotel, very convenient! We stopped here too much, my clothing was getting tighter and tighter! We took an Underground Tour of bunkers under subways, it was recommended by one of our friends who were staying at our hotel. This was a fantastic tour, really illuminated the way the Nazi’s thought and I was pleased with how humble our tour guide was, she was accurate and really owned the way the people of Nazi Germany’s views were very messed up and negative. I found this incredible attitude all over Germany, these people were model citizens who had learned and had grown from the negative Nazi prejudices’ to full ownership of the atrocities of that thinking. I really loved Berlin, and all of Germany and found this expanded vision everywhere I went. It was a great learning for me. We also took several Canal rides on the Spree River—first we took a one hour tour which was nice but very limited in where it visited. Several days later we took a 4 hour tour which visited all the locks and took us to many interesting locations. The 4 hours tour was about one hour too long and we jumped off the boat and found our way back to Berlin’s Mitte district easily using subways, trains, and trams. After being in Berlin for 10 days we really got the hang of public transportation and would have rented the car for less days since we paid for it, its parking space at our hotel, and gas (diesel). We all agreed that Berlin was a wonderful place to visit and were glad we had such a long and leisurely visit.",
"Birmingham" : "Birmingham is a former industrial powerhouse in the West Midlands region of England. Tourists to the city will have plenty to keep them busy, including shopping districts, canals, and historic architecture and monuments. Shop at BullringBullring is a shopping center in the heart of Birmingham. Selfridges Building holds the famous Selfridges Department Store, and is a truly unique, modern architectural wonder. The outside of the building is covered with over 15,000 aluminum discs, which gives it an almost otherworldly, space-like look. Bullring Shopping Centre contains over 160 different clothing stores, jewelry shops, restaurants, cafes, and bars. Whether you’re planning on a night out with friends or a quick trip to pick out a new outfit, Bullring will have you covered. After Bullring, check out some of the other shopping areas, like The Pavillions, The Pallasades, and The Mailbox.Walk along the canalsBirmingham wouldn’t have become the industrial juggernaut it was without its canals. Miles upon miles of canals were built to transport water to the city’s factories. Now, they serve as a tourist attraction and outdoor recreation area. Walk along the canals, go for a run, or rent bikes and cycle your way around Birmingham. Boats continue to operate in the canals, and for a few euros you can float down the canals and take in views of Birmingham you otherwise wouldn’t be able to see. The boat rides can be long, so make sure you have a few hours before your next engagement. Victoria Square is the heart of Birmingham. The Town Hall and Council House are both located here, and both are worth a visit. Dedicated to Queen Victoria in 1901, the square is a common meeting place for business people, artists, tourists, and locals. In the winter, Victoria Square is the site of the Birmingham Christmas Market; one of the largest markets of its kind outside of Austria and Germany. Regardless of the time of year you visit, Victoria Square will marvel you with its beauty. Besides statues and government buildings, Victoria Square is also home to centuries old churches, pubs, restaurants, and homes. Architects and history buffs will feel like they’ve been transported back into time when they see Victoria Square for the first time. For a little extra money, you can schedule a guided tour of the area. If you prefer a more relaxed approach, talk to the locals and ask them where to go. Residents of Birmingham are very friendly and they’ll point you in the right direction.",
"Seoul" : "A 5,000-year-old culture blended with startling modernity makes South Korea’s capital, Seoul, a fascinating place to visit. You’ll find old-fashioned tea shops and centuries-old temples with ornate roofs sitting between skyscrapers and smart malls selling the latest electronic gadgets, while the rocky peaks of Bukhansan National Park form a scenic backdrop. Tradition is important to Koreans, and even among hip young Seoulites, Confucian principles like respect for elders still hold sway. Visiting a Buddhist temple, sampling some fancy royal cuisine or tucking into a tabletop barbecue are simple ways you can get a taste of the local culture for yourself, even on a short visit. You might even choose to hang out with the friendly locals in the steam rooms and lounges of one of the popular bathhouses. Not far from Seoul is the Demilitarized Zone, a fascinating spot that marks the divide between South Korea and its secretive northern neighbors. Seoul Attractions Seoul has several ancient palaces. Gyeongbokgung, the oldest and grandest, was once the center of the important Joseon Dynasty and incorporates old Chinese and royal court architecture. Though the palace was established in 1395, the present building was constructed in the 1860s, the original having being destroyed during Japanese occupation. Nearby is UNESCO-listed Changdeokgung, which was completed in 1412 and once housed the royal family. It’s built on Confucian principles and features a lovely “secret” garden designed for scholarly reflection. The National Museum of Korea includes some beautiful artifacts like Buddha statues, calligraphy and an intricate 5th-century gold and jade crown. Admission is free. Full- and half-day tours to the Demilitarized Zone or DMZ outside Seoul are popular. This is the weapon-free no man’s land that has separated North and South Korea since the Korean War ended in 1953. You can descend into the “Third Tunnel,” which North Korea is believed to have dug in an attempt to breach the border and peer across to the neighbors through telescopes. Some full-day tours will also take in Panmunjom, the site of the armistice signing, where, under the gaze of soldiers, you can walk around a conference table into North Korean territory. You will need to book in advance and bring your passport. Looking for a pleasant day trip? Check out the seaside atmosphere of Wolmido Island , which has a fun fair and stalls selling seafood, including dried octopus tentacles. If you are interested in the Korean War, take a stroll in Jayu (Freedom) Park in Incheon, which features a monument to General MacArthur, who organized the pivotal U.N.-led Incheon landings. There’s more information in the Incheon Landing Operation Memorial Hall. In Seoul, you can visit the War Memorial of Korea, which includes a Korean War exhibition. Admission to both is free.",
"Honolulu" : "Honolulu, Hawaii’s largest city, is the hub of culture, politics, dining, shopping, business and entertainment in the Aloha State. After Captain James Cook became the first European to explore Hawaii in 1778, Honolulu became an increasingly important stop for ships traveling between America and Asia. First came fur traders, who made fortunes exchanging otter pelts from the Pacific Northwest for teas, spices and silks from China. Later, fragrant sandalwood became such a prized commodity that island forests were nearly stripped clean of it. Then came the whalers, who plied the seas relentlessly in search of the gentle giants that were the source of rich oil. In the mid-19th century, recognizing the importance of the harbor to local commerce, King Kamehameha III moved the capital of Hawaii from Lahaina, Maui to Honolulu, and it has held that designation ever since. Honolulu Harbor bustles with activity every day of the week. Fishing boats, tugboats, tour boats, container ships, cruise liners and barges berth at its piers. Whether you arrive by air or sea, Honolulu is your jumping-off place for an unforgettable Oahu stay. Honolulu Attractions World War II Valor in the Pacific National Monument — better known as the USS Arizona Memorial at Pearl Harbor — is one of Hawaii’s most visited (and most moving) sites. Informative exhibits and a video presentation set the stage for a boat ride out to the wreckage of the USS Arizona, where you can still catch a glimpse of the doomed battleship. A white memorial marks the site. Reflecting the opulence of the royal courts of Europe, Iolani Palace was the residence of Hawaii’s last reigning monarchs, King Kalakaua and Queen Liliuokalani. Construction was completed in 1882; 11 years later, the Hawaiian monarchy was overthrown. On display in the basement are the Hawaiian crown jewels as well as a collection of ancient Hawaiian regalia. On the upper floors are state apartments and private quarters. Star of Honolulu offers whale-watching excursions and sunset dinner cruises off the coast of Waikiki. Colorful, spice-scented Chinatown is roughly bordered by King, Smith, Beretania and River Streets. It’s one of Honolulu’s most fun neighborhoods to wander, with its open-air markets, historic buildings and mishmash of Asian cultures. Thousands of species of tropical flora thrive in the 14-acre urban oasis known as Foster Botanical Garden, which often is used as a site for weddings and other special events. Some of our favorite spots include the Lyon Orchid Garden and the Butterfly Garden. Guided tours are available. The Honolulu Museum of Art houses more than 50,000 works, including collections from Hawaii, Asia and Europe. Everything you want to learn about Hawaii you can probably learn at the Bishop Museum, whose collections include everything from Polynesian artifacts to cultural treasures of the Hawaiian royal family. There’s also a planetarium.",
"Manila" : "There is a reason why Manila has become a place where people are often talking about why you haven’t lived until you’ve seen this part of the world. Because there are plenty of people who haven’t seen it, it might be hard to figure out what to see and do once you get there. Rizal Park Rizal Park is one of those places you must absolutely take in when you go and visit Manila. This is the region’s answer for New York’s Central Park. True to form the scenery is plenty beautiful and there is enough to see that you can spend several hours there. The crowning jewel of the park is the Monument of Doctor Jose Rizal which stands near the center of the park. The statue is harldy the only thing worth seeing in the park, there is also a huge man made lake at the center of the park as well as an arboretum and other wonderful statues that make the scenery in Manila a real sight to see. Fort Santiago While Manila has plenty of stores and shops and hotels that are pleasing to the eye and can help you blow an afternoon, if you are going to visit the area then you should make sure to see things you can’t see anywhere else. Fort Santiago is the oldest Spanish Military Fort that has been built in Asia. It was constructed by conquistadors and still stands today, though obviously these days it’s more of a museum than a place anyone is going to go in order to garrison for armed conflict. These days you can take a walk through history and see what these forts used to look like.",
"Beijing" : "Beijing, the undulating metropolis located in remote northeastern China, would take many lifetimes to fully explore and understand. The city’s history is epic, with human fossil records dating back more than 230,000 years and evidence of cities in the vicinity of modern-day Beijing as early as the first millennium B.C. To make it digestible, let’s focus on the Beijing now — the noisy, dense, beating heart center that has kept China dominating the headlines — playing host to iconic revolution, the country’s first-ever Olympic games and more delectable Peking ducks than you can shake a chopstick at. Home to scores of monuments of great cultural or historic merit, including Tiananmen Square, the Forbidden City and the Temple of Heaven, Beijing is a must-visit city on any tour of China. (Plus, maybe you’ve heard of that big old wall they made a few millennia ago in an attempt to keep invading Mongols at bay — Beijing is also the most convenient jumping-off point for tours to the famous Great Wall of China.) For first-time visitors to east Asia, China — and Beijing in particular — may come off as overcrowded and dirty, but visitors who can get past Beijing’s no-apologies grittiness will find that the city has much to offer. From the Old World hutongs (historic neighborhoods) that line the alleyways in a testament to what once was, to the innumerable eateries and great bargain shops and endless seas of people that define what is now, Beijing will surely keep you busy taking it all in. While knowing Mandarin (or traveling with a fluent companion) will undoubtedly enhance your experience in Beijing, speaking only English need not keep you from getting a healthy taste of the city. Any hotelier who makes business of Western travelers will have staff who speak decent English, and there are a great number of restaurants and bars that offer English or picture menus. With a kind smile and a pen in hand, don’t be shy to ask hotel staff to write down the name and address of places you’d like to go on a card you can show a taxi driver. Although these days all sorts of motorized craft rule the roads, flat-as-a-pancake Beijing was made for bicycling. If you can afford the time to hire a bike for at least a day, you’ll be able to experience Beijing in a truly authentic way. For the rest of the time, there are plenty of taxis, subway cars and buses to make your way upon. For Beijing’s best weather, visit in September and October, when you’ll encounter warm sunny days with clear skies and cool evenings. Springtime is also a great season to visit, unless you’re super unlucky and get stuck in a sandstorm blowing down from the Gobi Desert in the north. Beijing is oppressively cold in winter and predictably hot in summer. Consider avoiding China’s major extended public holidays (Chinese New Year in winter, National Day in October and Labor Day in May), as huge swaths of domestic travelers will be moving in all conceivable directions. A great place to begin bumbling around Beijing is the Dongcheng area, near Houhai Lake. Here you can get a glimpse of everyday life in the hutongs, the centuries-old dwellings of Beijing of yore. Many hutongs have been demolished and replaced with the skyscraping apartment buildings that dominate Beijing’s skyline. But current hutong residents (and critics of overdevelopment) have fought for the remaining hutongs to be preserved. The city government has recognized the hutong’s tourist appeal and labeled them protected areas. Get a map, find the street known as Nanluogu Xiang (also sometimes written Nanluoguxiang) and use it as a starting point. The aforementioned Houhai Lake makes a lovely spot for a stroll in the warmer months, and when the lake freezes in winter you can rent skates (or a chair with sled-like runners affixed to the legs) and have a bit of fun on the ice. Missing out on Tiananmen Square while touring Beijing would be like not drinking Chianti when in Tuscany. The iconic square bustles with activity while exuding an air of old Soviet grandeur and that still-unshakable memory of Man vs. Tank. The Forbidden City is to famous Beijing monuments as fried rice is to a Chinese menu. Lying just beyond Tiananmen Square, the sprawling, walled encampment once housed the Imperial Court during the Ming and Qing dynasties and is so huge that many erstwhile residents are said to have gone their whole lives without leaving the 30-foot high walls of the city. To see every corner of the UNESCO World Heritage Site would surely take an entire day — and to be honest, it may all start to look the same after a while — so make sure you hit the impressive Palace Museum within the city walls before you wear yourself too thin. The Bird’s Nest and the Water Cube may be the most memorable venues of any Olympic Games in recent history. Though probably the kind of thing you can appreciate just as well from a postcard, the monuments are worthy of closer inspection if you find yourself in the Olympic Park area in east Beijing. Taking a stroll through one of Beijing’s parks in the morning hours is a great way to start a day in the city. Watch old men ponder over board games, admire groups of people practicing tai chi and get a taste of (sometimes contrived) Chinese landscaping. Beihai Park, Chaoyang Park and the Purple Bamboo Park are all good choices. If you can only visit one of Beiing’s parks, consider the vast green space that surrounds the Temple of Heaven. The temple complex was built under the command of the same emperor who ordered the construction of the Forbidden City. Dating back to 1420, the temple (which was visited by emperors to pray to the heavens for a good annual harvest) is a UNESCO World Heritage Site. The surrounding park is the greenest place in Beijing. An old Chinese proverb says, “Not been to the Great Wall, not a great man.” And indeed, no trip to China is complete without viewing the countryside’s rolling hills from the Great Wall. Almost every hotel in Beijing sells trips to the Great Wall. It’s important to know what you want, though, before you embark. Most tours to the wall visit the Badaling section. This is convenient because it’s very close to Beijing and the site is outfitted to cater to the masses (think cable cars, newly paved steps, handrails, even a toboggan slide to take you back to ground level). But Badaling is markedly touristy, replete with shops and food vendors and numerous touts hanging out on the wall itself. A quieter, more peaceful option is traveling to the Jinshanling section. Its distance from the metropolis (some three hours by bus) makes it a less popular option, but one still worth considering. There will be fewer tourists (and even fewer touts!) and you’ll be face to face with raw, scenic beauty without parking lots or handrails sullying the view.",
"Spokane" : "With the perfect location for all things wilderness, the city of Spokane offers nature lovers a jumping-off point for outdoor activities. Tourists can head to the nearby Cascade and Rocky Mountains for skiing and cycling, or check out any of the 76 area lakes and rivers for whitewater kayaking or rafting. Even the city itself offers a chance to commune with nature: The Riverfront Park has a scenic sky ride over the Spokane Falls. Visitors won't want to miss other Spokane attractions such as the world's largest wooden roller coaster or the downtown historic district. And more than 10 local wineries and distilleries offer a relaxing end to an active day. Spokane International Airport, four miles away from the city center, is the home base for flights to Spokane. With pleasant weather and an abundance of outdoor activities, Spokane is a year-round vacation destination. The most popular time to visit is in the summer and fall, when the weather is warm and an array of activities are available. Winter and spring can be chilly, but low prices and outdoor sports attract visitors. Spokane experiences four distinct seasons. The most favorable time to visit is in the summer and fall, when the weather is pleasant and dry. Summers are warm, with very little rainfall and temperatures in the 80s and 90s. Fall brings cooler weather, with temperatures in the 60s and 70s, and the leaves start changing. Winters can be chilly, with temperatures in the 20s and snow, particularly in the mountains. Spring stays fairly cool until July 4, with temperatures in the 40s and 50s. The busiest time to visit is in the summer, when the skies are clear and activities are plentiful. Festivals and events also tend to attract large crowds, including GameFest Spokane in April, Bloomsday and Spokane Lilac Festival in May, and Hoopfest in June. Most hotels, shops, and attractions remain open year-round. However, visitors are advised to avoid driving across the pass in the Cascade Mountains in the winter, as it often closes due to heavy storms. Hotels tend to be most expensive June through September when demand is highest due to conferences, and least expensive January through February. Last-minute accommodations are available year-round, though itâ€™s wise to book at least ten months in advance for major events such as Bloomsday and Hoopfest. Last-minute flights are available to Seattle-Tacoma Airport, but book three weeks in advance to ensure availability. Information provided by the Spokane Regional Convention and Visitors Bureau",
"Shenzhen" : "Shenzhen is modern, vibrant and progressive. For a big city, some 12 million people, it is very liveable and offers a mix of business opportunity and tourism attraction. It has a metro sysytem that covers most of the city and easy access to high speed trains that can shoot you to Guangzhou and beyond in no time. Highly developed transport infrastructure is definately one of the cities big advantages. Along with easy transport connections to other cities, it’s proximity to Hong Kong and Macau also makes it quite attractive for both holiday makers and business people. It is somewhat unique in that it is a migrant city, where people from across China come to live with the aim of getting a good paying job to support their families they left behind in their hometowns. Being a migrant city it a melting pot of the various Chinese customs and cultures. You can came across people speaking Cantonese, Sichuanhua, Hui, Min, Hakka and many other Chinese languages and dialetcs. Likewise you can find and enjoy many of Chinese cuisines in this one city with Cantonese being the native cuisine but you will easily find Sichuan, Hunun, Hui and many other types quite easily. Western food and cafes are also popular and of standard equal to elsewhere in the world. Being a migrant city, for a foreigner it has a different feel, as the locals are also not locals makes being a foreigner not so strange. The city is not famed for any historical attraction, although it does have a couple, it is most well known for it’s economic success, and in particular it’s electronic industry, you can get anything here and get anything made here when it comes to gadgets and consumer electronics. The beauty of the city is that it’s not all business, it is also a major tourism city featuring several theme parks, with OCT East being the largest. The city aslo offers nature escapes and some of the best beaches in China along the Dapeng Peninsula. The city is aslo becoming famed for its shopping, featuring many large malls offering luxury brands and major national and global retailers. It is a very comfortable place to live as a foreigner, with many areas feeling highly westernized, but at the same time you can still very easily experience traditional cultures from across China. The more people you get to know the greater those cultural experiences will be.",
"Melbourne" : "The place names may be familiar — our home town of Hampton, then Windsor, and of course Sandringham, where Dave has made his home, carry a whiff of royal patronage, but that is where the comparison with the Old World ends. The easygoing Sunday afternoon barbies on the patio showed us Poms how to unwind. Dave assured me that catering for twelve was ‘no sweat’ because everyone brings stuff and I should just relax! And he handed me a large glass of Chardonnay. He was right; no fuss, no pretension and everyone had a great time. Oh, and the food was fabulous. The Queen Victoria night market was a revelation. Lined with food stalls from countries and cultures of the world, the place hummed. We were tempted by Spanish, Iranian and Turkish dishes, but finally plumped for a steaming plate of Caribbean chickpeas with spicy sauce — this was no little England. We heard Italian, Greek, Arabic and Polish spoken amongst many other languages — a fantastically exciting taste of this great cosmopolitan city. Melbourne strikes me as a place that has got its balance right. It’s got old-style trams and picturesque Victorian shopping arcades alongside a beautiful skyline punctuated with the Rialto Towers – the overall picture is one of industry, activity and success. But this hasn’t just happened overnight, in the 1860’s, journalist George Sala wrote: ‘Marvellous Melbourne, a really astonishing city with broad streets and handsome shops and crowded with bustling well-dressed people.’ To that, I would add: on a friendly and human scale. A visit to the Immigration Museum brought to life what it means to be Australian, or rather how many different ways there are of being Australian. We learned that one in four Australians today were born elsewhere and we got a flavour of this diversity by walking over Sandbridge bridge, which crosses the Yarra river and links the city and Port Melbourne, where thousands landed for the first time. The bridge is decorated with giant figurines, ‘The Travellers’, and a panel for every country of origin, conjures up images of camel drivers who came from Afghanistan in the 19th century, alongside those seeking sanctuary from war and persecution today. We explored the City armed with a map, and if we looked lost a passer-by would greet us with, ‘Can I help you mate?’ And we’d soon be chatting like long lost friends. Melbournians are unfailingly big hearted and generous with their time — there’s no other big city where I’ve met this level of hospitality. Red-coated volunteer guides round every corner gave us great tips on free trams, boat trips and where to escape for a quiet half-hour. I love the way the city spreads out with space to breathe. Sarah and I wandered along the broad riverside paths and saw the city in all its glory — its bridges, soaring architecture, and expanses of green. We found it was safer than crossing roads where drivers tend to overtake every which way and cars appear without warning! We walked to the Botanic Gardens for a tour led by Ruth, our volunteer guide, who made the tour so engaging it was like walking through a lavishly illustrated storybook. We heard about the indigenous bunya-bunya pine tree which produces ten-kilo cones full of edible nuts, and the melaleuca tree or honey-myrtle, used by the Aboriginal peoples for splints. Ruth encouraged us to crush herbs between our fingers and inhale. Salt-bitter samphire used in cooking fish, comfrey or knitbone used by the Romans in poultices, and blue-green rue used in brooms to deter flies. Heady stuff! The four of us went back the following evening to see a production of Midsummer Night’s Dream against the natural backdrop of forest and the eerie screeching of birds. So two weeks into the holiday I can report that we were getting on fine, though there was a moment when Dave felt we were overdoing the fresh air when the temperature dropped to 20 degrees. Jim and Dave share a passion for cycling and were gearing up for the Alpine Classic event in Bright the following week — Jim had brought over his pedals and saddle — that serious. The closest I got to exercise was watching the Williams sisters winning the opening rounds of the Australian Open in seats we couldn’t afford at Wimbledon. I don’t follow tennis but seeing professionals perform live and at the top of their game knocked me out. How did you cope with the heat, I hear you ask, coming from sub-zero temperatures in double figures? Well, just fine thank you, except for one day when it got to 44 degrees and the only way to go was horizontally on Dave’s floor, dreaming of air-con. By early evening we dragged ourselves out to cool off in the pool, which was like a Jacuzzi at 37 degrees. But then all gave way to tropical downpours and a delicious breeze. The news brought daily reminders of the real and present danger of heat and fire and when we drove up to the Dandenongs we were shocked to learn that people in the outer suburbs had lost their lives in bushfires only last year. And the food? Fabulous! We gorged on peaches, guavas, melons, fruit so juicy it ran down to your elbows. Too hungry to drive any further one day, we pulled up at an unpromising roadside cafe, and Dave’s greeting of ‘How are you today?’ was met with, ‘Not too shabby, and you?’ From a young woman with such stunning good looks it summed up the Aussie gift for understatement and became a catchphrase for the whole trip. She served us with roast lamb fillets, rested to succulent perfection. Did it work as a sibling reunion? A resounding yes! We grew up together as children on a small island, but it was in Melbourne that we discovered the adults we have become. Where to next time? The challenge is on to find somewhere that comes even close to Melbourne, which was an unbeatable experience for us all. At least one of us made it here — lucky Dave!",
"Atlanta" : "The city of Atlanta is a vibrant metropolis full of activities. Whatever the reason for visiting, it's easy to live it up in the A-T-L. From sporting events to high art to fabulous shopping, Atlanta, Georgia, has it all. Sports fans will be ecstatic to watch one (or all) of the five professional teams—Atlanta Braves, Atlanta Dream, Atlanta Falcons, Atlanta Hawks, and Atlanta Thrashers—that call this city home. Theme park enthusiasts can play at Six Flags Over Georgia, Six Flags White Water, or Stone Mountain Park, home to the largest bas-relief sculpture in the world. Families can explore the nearly 40 acres of Zoo Atlanta and more than eight million gallons of water at the Georgia Aquarium. For more adult fare, take a tour of CNN; discover one of the oldest museums in Georgia, the Michael C. Carlos Museum; and end the day by sampling the beer at SweetWater Brewery. Be prepared to spend some cash because Atlanta shopping is top-notch, whether you prefer the antiques in Miami Circle or Bennett Street District, the designer labels in Phipps Plaza, or the unique items at Underground Atlanta. If free fun is more your style, then the Martin Luther King, Jr., National Historic Site or concerts at Centennial Olympic Park are attractive alternatives. As the busiest passenger airport in the world, the Hartsfield-Jackson Atlanta International Airport serves more than 80 million domestic passengers each year. With so many people passing through, flights to Atlanta are easy to find from most cities. When To Go With a nickname like Hotlanta, many assume that Atlanta is boiling hot year-round. However, summer is the only time when temperatures really escalate, and is also the most popular time, as visitors come to enjoy the area's many water parks. Spring and fall see pleasant temperatures and plenty of outdoor activities, including picnics under the blooming dogwoods or afternoon drives through the changing autumn leaves. Winters bring cooler weather and fewer visitors, but many people come in December for holiday shopping. Atlanta experiences four mild seasons. Spring sees warm weather and cool breezes, with temperatures in the high 60s to the upper 70s. Summers can get hot, reaching nearly 90 degrees, with a rise in humidity. Fall brings cool mornings, colorful foliage, and warm afternoons in the 60s and 70s. Winters can be short, with temperatures dropping into the 50s in December and rising again in March. The city is a convention destination, with crowds coming and going at any time of the year. This rarely affects tourist areas, but the MARTA, the rapid rail and bus transit, may get a little crowded. Holidays can also be a busy time for the city, especially at one of the many shopping centers such as Lenox Square and Phipps Plaza, and also during New Year's Eve with its Peach Drop event at the downtown Underground Atlanta complex. Many other festivals attract large crowds, including the Dogwood Festival in April, the Atlanta Jazz Festival in May, Fourth of July celebrations and the National Black Arts Festival in July, Pride in October and November, and the Festival of Trees in December. Neighborhood festivals are also crowd pleasers, such as the Inman Park Festival and the Virginia-Highland Summerfest. Closure Information Most hotels, shops, and attractions remain open throughout the year, but Six Flags Over Georgia closes in November and reopens again in March. When to Save Because Atlanta has one of the busiest airports in the country, visitors can find competitive airfares almost any time of the year. And since Atlanta offers a wide range of lodging options for an affordable price, finding a hotel to fit any budget isn't too difficult. Just keep a close eye on major events and conventions to ensure availability and avoid crowds. Many free events are available in the summer, including concerts by the Atlanta Symphony Orchestra and free admission to art galleries on Turner First Thursdays. Several other attractions also have free hours of admission or offer special discounts. Information provided by the Atlanta Convention and Visitors Bureau" 
}